Autodesk.Revit.UI.ExtendedPropertiesLinkUIData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.ExtendedPropertiesLinkUIData.Region
The cloud region of the link extended properties.
Since:
2027

Autodesk.Revit.UI.ExtendedPropertiesLinkUIData.DataSetPath
The Cloud DataSetPath for extended properties.
Since:
2027

Autodesk.Revit.UI.ExtendedPropertiesLinkUIData.LineageUrn
The lineage URN of the dataset holding extended properties.
Since:
2027

Autodesk.Revit.UI.ExtendedPropertiesLinkUIData.ProjectId
The projectId to link extended properties.
Since:
2027

Autodesk.Revit.UI.ExtendedPropertiesLinkUIData
The data associated with the extended properties link service.
Since:
2027